package com.example.bz4trams;

import android.content.Context;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;

import java.util.ArrayList;
import java.util.Collections;
import java.util.List;

public class StationsDatabaseHelper extends SQLiteOpenHelper {
    private static final String DATABASE_NAME = "stations.db";
    private static final int DATABASE_VERSION = 1;
    private static final String TABLE_NAME = "stations";
    private static final String COLUMN_NAME = "station_name";
    private static final String COLUMN_LINES = "station_lines";

    public StationsDatabaseHelper(Context context) {
        super(context, DATABASE_NAME, null, DATABASE_VERSION);
    }

    @Override
    public void onCreate(SQLiteDatabase db) {
        String createTableQuery = "CREATE TABLE " + TABLE_NAME + " (" +
                COLUMN_NAME + " TEXT, " +
                COLUMN_LINES + " TEXT)";
        db.execSQL(createTableQuery);
        List<String[]> stations = new ArrayList<>();
        String[][] tram2Stations = {
                {"Микрорайон Чистая Слобода 2 лн.", "2"},
                {"Облачная 2 лн.", "2"},
                {"Пос. Южный 2 лн.", "2"},
                {"Бийская 2 лн.", "2"},
                {"Танкистов 2 лн.", "2"},
                {"Парашютная 2 лн.", "2"},
                {"Широкий пер. 2 лн.", "2"},
                {"Пермская 2 лн.", "2"},
                {"Клуб им. Чехова 2 лн.", "2"},
                {"Степная (трамвай) 2 лн.", "2"},
                {"Квартал \"Софийский\" 2 лн.", "2"},
                {"Районная 2 лн.", "2"},
                {"Станиславского 2 лн.", "2"},
                {"Костычева 2 лн.", "2"},
                {"Римского-Корсакова (трамвай) 2 лн.", "2"},
                {"Дом радио 2 лн.", "2"},
                {"Вертковская (ул. Сибиряков-Гвардейцев) 2 лн.", "2"},
                {"Покрышкина 2 лн.", "2"},
                {"Метро Площадь Маркса 2 лн.", "2"}
        };


        String[][] tram3Stations = {
                {"Молкомбинат 3 лн.", "3"},
                {"Сибирский грузовой терминал 3 лн.", "3"},
                {"Завод ЖБИ-1 3 лн.", "3"},
                {"Сибэлектротерм 3 лн.", "3"},
                {"Палласа 3 лн.", "3"},
                {"Транспортная 3 лн.", "3"},
                {"ЭЛСИБ 3 лн.", "3"},
                {"Индустриальная 3 лн.", "3"},
                {"Торговый Город Левобережный 3 лн.", "3"},
                {"пл. Сибиряков-Гвардейцев 3 лн.", "3"},
                {"Покрышкина 3 лн.", "3"},
                {"Метро Площадь Маркса 3 лн.", "3"}
        };

        String[][] tram8Stations = {
                {"Микрорайон Чистая Слобода 8 лн.", "8"},
                {"Облачная 8 лн.", "8"},
                {"Пос. Южный 8 лн.", "8"},
                {"Бийская 8 лн.", "8"},
                {"Танкистов 8 лн.", "8"},
                {"Парашютная 8 лн.", "8"},
                {"Широкий пер. 8 лн.", "8"},
                {"Пермская 8 лн.", "8"},
                {"Клуб им. Чехова 8 лн.", "8"},
                {"Плахотного 8 лн.", "8"},
                {"Ленинский ЗАГС 8 лн.", "8"},
                {"Вокзал Новосибирск-западный 8 лн.", "8"},
                {"ГПТУ-50 8 лн.", "8"},
                {"ДК Металлург 8 лн.", "8"},
                {"Тепличная 8 лн.", "8"},
                {"Зональный институт 8 лн.", "8"},
                {"Блюхера 8 лн.", "8"},
                {"Метро Студенческая (трамвай) 8 лн.", "8"},
                {"Космическая 8 лн.", "8"},
                {"Магазин Телевизоры 8 лн.", "8"},
                {"Титова 8 лн.", "8"}
        };


        String[][] tram10Stations = {
                {"Степная (трамвай) 10 лн.", "10"},
                {"Квартал \"Софийский\" 10 лн.", "10"},
                {"Районная 10 лн.", "10"},
                {"Станиславского 10 лн.", "10"},
                {"Костычева 10 лн.", "10"},
                {"Римского-Корсакова (трамвай) 10 лн.", "10"},
                {"Дом радио 10 лн.", "10"},
                {"Вертковская (ул. Сибиряков-Гвардейцев) 10 лн.", "10"},
                {"пл. Сибиряков-Гвардейцев 10 лн.", "10"},
                {"Мира 10 лн.", "10"},
                {"Строительная (ул. Мира) 10 лн.", "10"},
                {"Прокатная 10 лн.", "10"},
                {"Рабочая 10 лн.", "10"},
                {"Посуда Центр 10 лн.", "10"},
                {"Промышленная 10 лн.", "10"},
                {"Тюменская 10 лн.", "10"},
                {"Оловозаводская 10 лн.", "10"},
                {"Бугринская роща (трамвай) 10 лн.", "10"}
        };


        String[][] tram15Stations = {
                {"Бугринская роща (трамвай) 15 лн.", "15"},
                {"Оловозаводская 15 лн.", "15"},
                {"Тюменская 15 лн.", "15"},
                {"Промышленная 15 лн.", "15"},
                {"Посуда Центр 15 лн.", "15"},
                {"Рабочая 15 лн.", "15"},
                {"Прокатная 15 лн.", "15"},
                {"Строительная (ул. Мира) 15 лн.", "15"},
                {"Мира 15 лн.", "15"},
                {"пл. Сибиряков-Гвардейцев 15 лн.", "15"},
                {"Покрышкина 15 лн.", "15"},
                {"Метро Площадь Маркса 15 лн.", "15"},
                {"Титова 15 лн.", "15"},
                {"Магазин Телевизоры 15 лн.", "15"},
                {"Космическая 15 лн.", "15"},
                {"Метро Студенческая (трамвай) 15 лн.", "15"},
                {"Блюхера 15 лн.", "15"},
                {"Зональный институт 15 лн.", "15"},
                {"Тепличная 15 лн.", "15"},
                {"ДК Металлург 15 лн.", "15"},
                {"ГПТУ-50 15 лн.", "15"},
                {"Вокзал Новосибирск-западный 15 лн.", "15"},
                {"Ленинский ЗАГС 15 лн.", "15"},
                {"Плахотного 15 лн.", "15"},
                {"Клуб им. Чехова 15 лн.", "15"},
                {"Степная (трамвай) 15 лн.", "15"},
                {"Квартал \"Софийский\" 15 лн.", "15"},
                {"ж/м Станиславский (трамвай) 15 лн.", "15"},
                {"Кирзавод 15 лн.", "15"},
                {"Автокомбинат 15 лн.", "15"},
                {"9 Гвардейской дивизии 15 лн.", "15"},
                {"Волховская 15 лн.", "15"},
                {"Школа №174 15 лн.", "15"},
                {"ж/м Юго-Западный 15 лн.", "15"}
        };


        String[][] tram16Stations = {
                {"ж/м Юго-Западный 16 лн.", "16"},
                {"Школа №174 16 лн.", "16"},
                {"Волховская 16 лн.", "16"},
                {"9 Гвардейской дивизии 16 лн.", "16"},
                {"Автокомбинат 16 лн.", "16"},
                {"Кирзавод 16 лн.", "16"},
                {"ж/м Станиславский (трамвай) 16 лн.", "16"},
                {"Квартал \"Софийский\" 16 лн.", "16"},
                {"Районная 16 лн.", "16"},
                {"Станиславского 16 лн.", "16"},
                {"Костычева 16 лн.", "16"},
                {"Римского-Корсакова (трамвай) 16 лн.", "16"},
                {"Дом радио 16 лн.", "16"},
                {"Вертковская (ул. Сибиряков-Гвардейцев) 16 лн.", "16"},
                {"Покрышкина 16 лн.", "16"},
                {"Метро Площадь Маркса 16 лн.", "16"}
        };



        String[][] tram18Stations = {
                {"ж/м Юго-Западный 18 лн.", "18"},
                {"Школа №174 18 лн.", "18"},
                {"ЖК Радуга 18 лн.", "18"},
                {"Оборонная 18 лн.", "18"},
                {"Связистов 18 лн.", "18"},
                {"ж/м Танкистов 18 лн.", "18"},
                {"Озёрная (ул. Связистов) 18 лн.", "18"},
                {"ж/м Троллейный (трамвай) 18 лн.", "18"},
                {"Невельского 18 лн.", "18"},
                {"Широкая 18 лн.", "18"},
                {"Киевская 18 лн.", "18"},
                {"Хлебозавод 18 лн.", "18"},
                {"Вокзал Новосибирск-западный 18 лн.", "18"},
                {"ГПТУ-50 18 лн.", "18"},
                {"ДК Металлург 18 лн.", "18"},
                {"Тепличная 18 лн.", "18"},
                {"Зональный институт 18 лн.", "18"},
                {"Блюхера 18 лн.", "18"},
                {"Метро Студенческая (трамвай) 18 лн.", "18"},
                {"Космическая 18 лн.", "18"},
                {"Магазин Телевизоры 18 лн.", "18"},
                {"Титова 18 лн.", "18"},
                {"Метро Площадь Маркса 18 лн.", "18"},
                {"Покрышкина 18 лн.", "18"},
                {"пл. Сибиряков-Гвардейцев 18 лн.", "18"},
                {"Торговый Город Левобережный 18 лн.", "18"},
                {"Индустриальная 18 лн.", "18"},
                {"пл. Кирова 18 лн.", "18"},
                {"Бульвар 18 лн.", "18"},
                {"Кировский универмаг 18 лн.", "18"},
                {"Весенняя 18 лн.", "18"},
                {"Петухова 18 лн.", "18"},
                {"пос. Чемской 18 лн.", "18"}
        };


        Collections.addAll(stations, tram2Stations);
        Collections.addAll(stations, tram3Stations);
        Collections.addAll(stations, tram8Stations);
        Collections.addAll(stations, tram10Stations);
        Collections.addAll(stations, tram15Stations);
        Collections.addAll(stations, tram16Stations);
        Collections.addAll(stations, tram18Stations);


        for (String[] station : stations) {
            insertStation(db, station[0], station[1]);
        }

    }

    @Override
    public void onUpgrade(SQLiteDatabase db, int oldVersion, int newVersion) {
        // Обновление базы данных, если необходимо
        // Тут можно добавить логику, если требуется обновление схемы базы данных
    }

    private void insertStation(SQLiteDatabase db, String stationName, String stationLines) {
        String insertQuery = "INSERT INTO " + TABLE_NAME + " (" +
                COLUMN_NAME + ", " +
                COLUMN_LINES + ") VALUES ('" +
                stationName + "', '" +
                stationLines + "')";
        db.execSQL(insertQuery);
    }
}

